import json

import pytest
from numpy import nan
from pandas import DataFrame, Timestamp


@pytest.fixture
def user_set():
    return {
        "user_currencies": ["USD", "EUR"],
        "user_stocks": ["AAPL", "AMZN"]
    }


@pytest.fixture
def test_df_expected():
    return DataFrame({'Дата операции': ['30.10.2021 16:39:04', '30.10.2021 15:44:39'],
                      'Дата платежа': ['30.10.2021', '30.10.2021'],
                      'Номер карты': ['*4393', '*7197'],
                      'Статус': ['OK', 'OK'],
                      'Сумма операции': [-118.12, -78.05],
                      'Валюта операции': ['RUB', 'RUB'],
                      'Сумма платежа': [-118.12, -78.05],
                      'Валюта платежа': ['RUB', 'RUB'],
                      'Кэшбэк': [nan, nan],
                      'Категория': ['Переводы', 'Супермаркеты'],
                      'MCC': [5411.0, 5411.0],
                      'Описание': ['Магнит', 'Колхоз'],
                      'Бонусы (включая кэшбэк)': [2, 1],
                      'Округление на инвесткопилку': [0, 0],
                      'Сумма операции с округлением': [118.12, 78.05]})


@pytest.fixture
def test_df():
    return DataFrame({'Дата операции': [Timestamp('2021-10-31 16:44:00'), Timestamp('2021-10-30 16:42:04'),
                                        Timestamp('2021-10-30 16:39:04'), Timestamp('2021-10-30 15:44:39'),
                                        Timestamp('2021-10-30 01:23:42')],
                      'Дата платежа': ['31.10.2021', '30.10.2021', '30.10.2021', '30.10.2021', '30.10.2021'],
                      'Номер карты': ['*7197', '*7197', '*4393', '*7197', '*5091'],
                      'Статус': ['OK', 'OK', 'OK', 'OK', 'OK'],
                      'Сумма операции': [-160.89, -64.0, -118.12, -78.05, 564.0],
                      'Валюта операции': ['RUB', 'RUB', 'RUB', 'RUB', 'RUB'],
                      'Сумма платежа': [-160.89, -64.0, -118.12, -78.05, 564.0],
                      'Валюта платежа': ['RUB', 'RUB', 'RUB', 'RUB', 'RUB'],
                      'Кэшбэк': [nan, nan, nan, nan, nan],
                      'Категория': ['Супермаркеты', 'Переводы', 'Переводы', 'Супермаркеты', 'Различные товары'],
                      'MCC': [5411.0, 5411.0, 5411.0, 5411.0, 5399.0],
                      'Описание': ['Колхоз', 'Колхоз', 'Магнит', 'Колхоз', ' http://Ozon.ru'],
                      'Бонусы(включая кэшбэк)': [3, 1, 2, 1, 5],
                      'Округление на инвесткопилку': [0, 0, 0, 0, 0],
                      'Сумма операции с округлением': [160.89, 64.0, 118.12, 78.05, 564.0]})
