import json

import pytest
from numpy import nan

from src.services import pd_search


@pytest.mark.parametrize(
    "value, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Maestro 15968378687051", "Номер карты введен неверно"),
        ("Maestro fsdaf", "Номер карты введен неверно"),
        ("Maestro ", "Номер введен неверно"),
        ("Ma ", "Номер введен неверно"),
        ("Maestro 15968378687051994567", "Номер карты введен неверно"),
        ("Maestro 1dd6837868705199", "Номер карты введен неверно"),
        ("Счет 64686473678894779589", "Счет **9589"),
        ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
        ("Visa Platinum 8990922113665229", "Visa Platinum 8990 92** **** 5229"),
        ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
        ("Visa Gold 59994142284263", "Номер карты введен неверно"),
        ("Visa Gold 59994142284263231", "Номер карты введен неверно"),
        ("Счет 73654108430135874305", "Счет **4305"),
        ("Счет ff654108430135874305", "Номер счета введен неверно"),
        ("Счет 45421", "Номер счета введен неверно"),
        ("Счет ", "Номер введен неверно"),
        ("Счт", "Номер введен неверно"),
        ("", "Номер введен неверно"),
    ],
)
def test_pd_search(test_df):
    assert pd_search(test_df, "Переводы") == json.dumps(
        [{"Дата операции": "2021-10-30 16:42:04", "Дата платежа": "30.10.2021", "Номер карты": "*7197", "Статус": "OK",
          "Сумма операции": -64.0, "Валюта операции": "RUB", "Сумма платежа": -64.0, "Валюта платежа": "RUB",
          "Кэшбэк": nan, "Категория": "Переводы", "MCC": 5411.0, "Описание": "Колхоз", "Бонусы(включая кэшбэк)": 1,
          "Округление на инвесткопилку": 0, "Сумма операции с округлением": 64.0},
         {"Дата операции": "2021-10-30 16:39:04", "Дата платежа": "30.10.2021", "Номер карты": "*4393", "Статус": "OK",
          "Сумма операции": -118.12, "Валюта операции": "RUB", "Сумма платежа": -118.12, "Валюта платежа": "RUB",
          "Кэшбэк": nan, "Категория": "Переводы", "MCC": 5411.0, "Описание": "Магнит", "Бонусы(включая кэшбэк)": 2,
          "Округление на инвесткопилку": 0, "Сумма операции с округлением": 118.12}], ensure_ascii=False, indent=4)
