import json

from src.services import pd_search
from numpy import nan


def test_pd_search(test_df):
    assert pd_search(test_df, "Переводы") == json.dumps(
        [{"Дата операции": "2021-10-30 16:42:04", "Дата платежа": "30.10.2021", "Номер карты": "*7197", "Статус": "OK",
          "Сумма операции": -64.0, "Валюта операции": "RUB", "Сумма платежа": -64.0, "Валюта платежа": "RUB",
          "Кэшбэк": nan, "Категория": "Переводы", "MCC": 5411.0, "Описание": "Колхоз", "Бонусы(включая кэшбэк)": 1,
          "Округление на инвесткопилку": 0, "Сумма операции с округлением": 64.0},
         {"Дата операции": "2021-10-30 16:39:04", "Дата платежа": "30.10.2021", "Номер карты": "*4393", "Статус": "OK",
          "Сумма операции": -118.12, "Валюта операции": "RUB", "Сумма платежа": -118.12, "Валюта платежа": "RUB",
          "Кэшбэк": nan, "Категория": "Переводы", "MCC": 5411.0, "Описание": "Магнит", "Бонусы(включая кэшбэк)": 2,
          "Округление на инвесткопилку": 0, "Сумма операции с округлением": 118.12}], ensure_ascii=False, indent=4)
